# aa = []
# bb = []
# value = 0

# # 0부터 2씩 증가, 198까지
# for i in range(0,100) :
#     aa.append(value)
#     value += 2
# print(aa)

# # 198부터 2씩 증가, 0까지 역순
# for i in range(0,100) : 
#     bb.append(aa[99-i])
# print(bb)


# # 리스트 내포 / 0부터 2씩 증가, 198까지 (aa리스트와 동일)
# cc = list(range(0,200,2))
# print(cc)

# # 리스트 내포 / 2부터 200까지 2씩 증가
# dd = [i+2 for i in range(0,200,2)]
# print(dd)



# # 리스트의 더하기와 곱하기
# ee = [10,20,30]
# print(ee*3)
# # 결과값은 [10, 20, 30, 10, 20, 30, 10, 20, 30]

# ff = [1,2,3,4]
# print(ee+ff)
# # 결과값은 [10, 20, 30, 1, 2, 3, 4]



# # - 마이너스
# gg = [10,20,30,40,50,60,70]
# print(gg[::-1])     # 결과값은 [70, 60, 50, 40, 30, 20, 10]
# print(gg[::-2])     # 결과값은 [70, 50, 30, 10]




# 리스트 수정
stu_list = [
    [1,"홍길동",100,90,80,270,90.0],
    [2,"유관순",90,80,70,240,80.0],
    [3,"이순신",80,70,60,210,70.0],
]

# stu_list[0][1] = "홍길자"
# print(stu_list)
# # 결과값은 홍길동 -> 홍길자

# print(stu_list[0][2], stu_list[0][3])
# # 결과값은 100 90

# 유관순 국어 점수 100, 영어 점수 70으로 변경하기
stu_list[1][2] = 100
stu_list[1][3] = 50
stu_list[1][5] = stu_list[1][2]+stu_list[1][3]+stu_list[1][4]
stu_list[1][6] = stu_list[1][5]/3
print(stu_list)

# 결과값은
# [[1, '홍길동', 100, 90, 80, 270, 90.0], [2, '유관순', 100, 50, 70, 220, 73.33333333333333], [3, '이순신', 80, 70, 60, 210, 70.0]]

