print("결과값: %d" %10)
print("결과값: %d, 결과값: %d" %(10+5, 10-5))

#앞으로는 아래 형식을 많이 쓰게 될 것
print("결과값: {}".format(10))
print("결과값: {:d}".format(100))
print("결과값: {}, 소수점: {}".format(10, 5.123))

print("%d, %f" %(100, 2.3))

print("곱하기: {}".format(123*567))

print("덧셈: {}, 뺄셈: {}, 곱셈: {}, 나눗셈: {}".format(10+3,10-3,10*3,10/3))
print("덧셈: {}, 뺄셈: {}, 곱셈: {}, 나눗셈: {:.2f}".format(10+3,10-3,10*3,10/3))
#{:.2f} 소수점 2자리까지 {:10.2f} 총 10자리 중 소수점 2자리까지 출력
print("실수: {}".format(10/3))
print("실수: {:10.2f}".format(10/3))
print("실수: {:010.2f}".format(10/3))

print("번호: {:3d}".format(10))
print("번호: {:03d}".format(10))
print("번호: {:07d}".format(10))


#예제: 20*3, 20/3 나눗셈 소수점 1자리까지만 출력
print("곱셈: {}, 나눗셈: {:.1f}".format(20*3, 20/3))
print("곱셈: {:05d}, 나눗셈: {:05.1f}".format(20*3, 20/3))


